naboo_30ms_8deg/system/forceCoeffs
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
#include "../0/include/initialConditions"

forceCoeffs1
{
    type            forceCoeffs;
    libs            ("libforces.so");
    writeControl    timeStep;
    timeInterval    1;
    log             yes;
    patches         (nabooGroup);
    rho             rhoInf;
    rhoInf          1;

    // --- CASE 4 Values ---
    liftDir         (-0.1392 0 0.9903);
    dragDir         (0.9903 0 0.1392);
    magUInf         30;
    // ---------------------

    CofR            (0.72 0 0);  // Keep your original value
    pitchAxis       (0 1 0);     // Keep your original value
    lRef            27.59;       // Keep your original value (Warning: Review this later)
    Aref            35.2;        // Keep your original value (Warning: Review this later)
}
// ************************************************************************* //
